{
  "page.index.hi": "Hi！",
  "page.index.one": "You can call me",
  "page.index.name": "Robin",
  "page.index.two": "I am engaged in java backend and web3 contract development. I am a person who has many ideas, loves to share and loves to learn new technologies!",
  "page.index.three": "If you want to contact me, you can contact me via telegram!",
  "page.index.four": "work skill",
  "page.index.about": "about",
  "page.index.home": "home",
  "page.index.five": "I am relatively familiar with the eth chain, bnb chain, and apt chain, and have an in-depth understanding of lp staking and swap, V2swap exchange, etc.",
  "page.index.skill": "skill",
  "page.index.solidity.one": " 1. Be proficient in the Solidity programming language and understand basic syntax such as contract structure, functions, and variable declarations.",
  "page.index.solidity.two": " 2. Understand the data types, control structures, function modifiers, etc. in Solidity.",
  "page.index.solidity.three": "3. Ability to write smart contracts, including standard contracts such as ERC-20 and ERC-721.",
  "page.index.solidity.four": "4. Understand the life cycle, deployment, calling, etc. of smart contracts.",
  "page.index.solidity.five": "5. Understand the basic principles and operating mechanisms of the Ethereum blockchain network.",
  "page.index.solidity.six": "6. Know how to connect to the Ethereum network and choose the appropriate node service.",
  "page.index.solidity.seven": "7. Master Ethereum JavaScript libraries such as Web3.js or Ethers.js to interact with the Ethereum blockchain.",
  "page.index.solidity.eight": "8. Able to call contract functions through the library, query status and send transactions.",
  "page.index.solidity.nine": "9. Familiar with Solidity development frameworks such as Hardhat for contract compilation, testing and deployment.",
  "page.index.solidity.ten": "10. Understand the security issues of smart contracts and avoid common vulnerabilities, such as re-entrancy attacks, overflows, etc.",
  "page.index.solidity.eleven": "11. Use tools to conduct code audits to ensure the security of the contract.",
  "page.index.solidity.twelve": "12. Optimize the gas consumption of smart contracts and improve the execution efficiency of contracts.",
  "page.index.solidity.thirteen": "13. Understand the concepts of gas price and gas limit.",
  "page.index.java.one": "1. I'm familiar with the Spring Boot, Spring Cloud, and Spring Cloud Alibaba microservices framework system and suites. I have expertise in service registration and discovery, service rate limiting, degradation, and circuit breaking. Additionally, I possess hands-on experience in live production environments and am knowledgeable about commonly used high-concurrency solutions.",
  "page.index.java.two": "2. I am proficient in writing and optimizing SQL queries for databases, with practical experience in transactions, indexing, and online optimization of slow SQL queries.",
  "page.index.java.three": "3. I have a deep understanding of Redis, including the various use cases for caching different data structures. I comprehend high-availability clusters, and I am knowledgeable about Redis distributed lock usage. Additionally, I am familiar with persistence and clustering in Redis.",
  "page.index.java.four": " 4.Familiar with common web development concepts, including HTTP protocol, RESTful architecture, etc.",
  "page.index.java.five": "5. Have a basic understanding of modern front-end frameworks (such as React, Angular or Vue.js).",
  "page.index.java.six": "6. Understand and practice microservice architecture, including service discovery, containerization (Docker), container orchestration (Kubernetes), etc.",
  "page.index.java.seven": "7. I am proficient in using message queue (MQ) components for asynchronous processing. I am familiar with the ACK message acknowledgment mechanism, considerations related to message loss, message ordering, and handling scenarios involving duplicate message consumption.",
  "page.index.java.eight": "8. Be familiar with common security vulnerabilities and preventive measures, including cross-site scripting (XSS), cross-site request forgery (CSRF), etc.",
  "page.index.java.nine": "9. Implement authentication and authorization and understand OAuth and JWT.",
  "page.index.java.ten": "10. Familiar with version control tools, such as Git.",
  "page.index.java.eleven": "11. I am familiar with Linux, including basic operational and deployment commands. I have a command of commonly used Docker commands and understand the process of handling project code, including compilation, image building, and deployment to Kubernetes clusters.",
  "page.index.java.twelve": "12. I am familiar with distributed transaction solutions and have a deep understanding of distributed CAP theory and BASE theory. I have expertise in both rigid transaction models such as 2PC (Two-Phase Commit) and 3PC (Three-Phase Commit), as well as flexible transaction models like TCC (Try-Confirm-Cancel), local message table, independent message service for distributed transactions, reliable message eventual consistency, and best-effort notification.",
  "page.index.sql.one": "1. Be proficient in SQL (Structured Query Language), including basic operations such as adding, deleting, modifying, and querying data.",
  "page.index.sql.two": " 2. Understand advanced SQL operations such as complex queries, joins, and subqueries.",
  "page.index.sql.three": "3. Be able to design standardized database models, including table design, relationship establishment, index use, etc.",
  "page.index.sql.four": "4. Understand the concepts of normalization and de-normalization.",
  "page.index.sql.five": "5. Understand the types of indexes (such as B-tree indexes, hash indexes) and their role in database query performance optimization.",
  "page.index.sql.six": "6. Be able to select appropriate fields to create indexes and avoid index abuse.",
  "page.index.sql.seven": "7. Understand the concept of database transactions and master the ACID characteristics of transactions.",
  "page.index.sql.eight": "8. Be able to use transactions correctly to ensure data consistency and integrity.",
  "page.index.sql.nine": "9. Use database performance analysis tools to locate and solve problems such as slow queries and performance bottlenecks.",
  "page.index.sql.ten": "10. Optimize query statements to avoid full table scans and improve query efficiency.",
  "page.index.sql.eleven": "11. Avoid security threats such as SQL injection.",
  "page.index.sql.twelve": "12. Familiar with master-slave replication, read-write separation and other technologies.",
  "page.index.source": "source code",
  "page.about.one": "I graduated from Fuzhou University of Technology in 2019. When it comes to programming, I was initially completely clueless. Concepts like objects, classes, and variables were foreign to me, and I had no understanding of how various logics were implemented. My major was in Electronic Information Engineering, and I felt that I had exposure to both software and hardware aspects equally. I still remember starting with analog and digital circuits, followed by diving into object-oriented programming and embedded systems.\n\nWhile introduced to circuit design, I found my interest not particularly strong. When tasked with assembly and hardware, I didn't dedicate enough effort to learning, which increased the difficulty level for someone with a zero foundation. Ultimately, I chose to learn Java and object-oriented programming.",
  "page.about.two": "My first job was at Fuda Automation Technology, where the technology was relatively straightforward. I believe anyone with some programming knowledge could handle the tasks. However, this job brought me many valuable experiences and was truly a stepping stone for me. Many technologies that were unclear to me initially became much clearer over time. Through searching for information and problem-solving in my work, my technical skills significantly improved.\n\nAfter becoming familiar with the job over the course of a year and a half, I started feeling a sense of confusion. The technologies here seemed too simplistic for my aspirations. Basic problems that could be solved with programs were being addressed using stored procedures and triggers. I began to feel a disconnection, sensing that I needed to move on to something more challenging.",
  "page.about.three": "Later, I joined a company that develops SRM and CRM systems. Here, I got exposed to technologies like Spring Boot and Spring Cloud for microservices. I learned about service registration using tools like Nacos, how to introduce dependencies for inter-service communication in microservices, and the utilization of RabbitMQ for queuing in cross-platform service calls. The technical challenges here were not overly complex, mostly involving database design and ensuring data consistency with Redis synchronization locks.\n\nIn the CRM and SRM domains, a significant emphasis was placed on business logic, and a considerable amount of time was spent refining and organizing business processes. I often delved into understanding various aspects of permission architecture, such as menu-role-user permissions, table design, and button permissions. Initially, dealing with frequent changes in requirements and the need for code modifications proved challenging, especially when modifying others' code. The most daunting task was dealing with jQuery code snippets within components—implementing various restrictions led to scattered and hard-to-understand code, further exacerbated by conflicting permissions.\n\nWhen dealing with existing code, I found it beneficial to pull each functional module's code separately and optimize it rather than making immediate changes. This approach not only helped in understanding the codebase better but also facilitated smoother optimization in the later stages.",
  "page.about.four": "Finally, I joined a company specializing in blockchain technology. Initially, I lacked confidence in this field due to the perceived instability and risks associated with it. I won't dwell on that judgment, as I don't have the qualifications to make such assessments. However, working here has been incredibly fulfilling, with everyone actively pursuing new technologies and frequently optimizing code. The culture involves refining and optimizing well-written code repeatedly. Whenever a new technology or project emerges, the team collectively delves into the source code, referencing implementations and fostering a continuous learning environment. I truly enjoy this dynamic atmosphere.\n\nThe first project I encountered here was an NFT (Non-Fungible Token) project. While I may not fully grasp the inherent value of NFTs—perhaps it lies in their uniqueness and scarcity—what stands out is that tokens represent virtual creations, similar to how each country issues its own currency. The ERC-20 technology enables anyone to issue tokens, and their value is contingent upon the efforts of the issuing organization or individual.\n\nI delved into the development and rise of Web3, exploring various financial mechanisms and conducting tests with some coins to familiarize myself with the processes. GameFi caught my interest—a fascinating concept where NFTs serve as the central gaming elements, tokens function as in-game currency, and NFTs generate daily income in tokens. Although I haven't played GameFi myself, I've gained some understanding of its dynamics.\n\nSubsequently, I delved into understanding swap mechanisms, initially encountering Uniswap and later exploring platforms like PancakeSwap. It was essential to grasp information about on-chain blocks, transactions, and other details.",
  "page.about.five": "now work？",
  "page.about.six": "I'm still looking for it at the moment. If you want to outsource work to me or work remotely, you can contact me. If you have a formal full-time job, you can contact me.",
  "page.about.technology.stack": "technology stack",
  "page.about.cooperate": "cooperate",
  "page.about.eleven": "If you think my technology can help you, you can contact me directly."
}
