{
  "page.index.hi": "Hi！",
  "page.index.one": "You can call me ",
  "page.index.name": "Robin",
  "page.index.two": "I am engaged in java backend and web3 contract development. I am a person who has many ideas, loves to share and loves to learn new technologies!",
  "page.index.three": "If you want to contact me, you can contact me via telegram!",
  "page.index.four": "work skill",
  "page.index.about": "about",
  "page.index.home": "home",
  "page.index.five": "I am relatively familiar with the eth chain, bnb chain, and apt chain, and have an in-depth understanding of lp staking and swap, V2swap exchange, etc.",
  "page.index.skill": "skill",
  "page.index.solidity.one": " 1. Be proficient in the Solidity programming language and understand basic syntax such as contract structure, functions, and variable declarations.",
  "page.index.solidity.two": " 2. Understand the data types, control structures, function modifiers, etc. in Solidity.",
  "page.index.solidity.three": "3. Ability to write smart contracts, including standard contracts such as ERC-20 and ERC-721.",
  "page.index.solidity.four": "4. Understand the life cycle, deployment, calling, etc. of smart contracts.",
  "page.index.solidity.five": "5. Understand the basic principles and operating mechanisms of the Ethereum blockchain network.",
  "page.index.solidity.six": "6. Know how to connect to the Ethereum network and choose the appropriate node service.",
  "page.index.solidity.seven": "7. Master Ethereum JavaScript libraries such as Web3.js or Ethers.js to interact with the Ethereum blockchain.",
  "page.index.solidity.eight": "8. Able to call contract functions through the library, query status and send transactions.",
  "page.index.solidity.nine": "9. Familiar with Solidity development frameworks such as Hardhat for contract compilation, testing and deployment.",
  "page.index.solidity.ten": "10. Understand the security issues of smart contracts and avoid common vulnerabilities, such as re-entrancy attacks, overflows, etc.",
  "page.index.solidity.eleven": "11. Use tools to conduct code audits to ensure the security of the contract.",
  "page.index.solidity.twelve": "12. Optimize the gas consumption of smart contracts and improve the execution efficiency of contracts.",
  "page.index.solidity.thirteen": "13. Understand the concepts of gas price and gas limit.",
  "page.index.java.one": "1. I'm familiar with the Spring Boot, Spring Cloud, and Spring Cloud Alibaba microservices framework system and suites. I have expertise in service registration and discovery, service rate limiting, degradation, and circuit breaking. Additionally, I possess hands-on experience in live production environments and am knowledgeable about commonly used high-concurrency solutions.",
  "page.index.java.two": "2. I am proficient in writing and optimizing SQL queries for databases, with practical experience in transactions, indexing, and online optimization of slow SQL queries.",
  "page.index.java.three": "3. I have a deep understanding of Redis, including the various use cases for caching different data structures. I comprehend high-availability clusters, and I am knowledgeable about Redis distributed lock usage. Additionally, I am familiar with persistence and clustering in Redis.",
  "page.index.java.four": " 4.Familiar with common web development concepts, including HTTP protocol, RESTful architecture, etc.",
  "page.index.java.five": "5. Have a basic understanding of modern front-end frameworks (such as React, Angular or Vue.js).",
  "page.index.java.six": "6. Understand and practice microservice architecture, including service discovery, containerization (Docker), container orchestration (Kubernetes), etc.",
  "page.index.java.seven": "7. I am proficient in using message queue (MQ) components for asynchronous processing. I am familiar with the ACK message acknowledgment mechanism, considerations related to message loss, message ordering, and handling scenarios involving duplicate message consumption.",
  "page.index.java.eight": "8. Be familiar with common security vulnerabilities and preventive measures, including cross-site scripting (XSS), cross-site request forgery (CSRF), etc.",
  "page.index.java.nine": "9. Implement authentication and authorization and understand OAuth and JWT.",
  "page.index.java.ten": "10. Familiar with version control tools, such as Git.",
  "page.index.java.eleven": "11. I am familiar with Linux, including basic operational and deployment commands. I have a command of commonly used Docker commands and understand the process of handling project code, including compilation, image building, and deployment to Kubernetes clusters.",
  "page.index.java.twelve": "12. I am familiar with distributed transaction solutions and have a deep understanding of distributed CAP theory and BASE theory. I have expertise in both rigid transaction models such as 2PC (Two-Phase Commit) and 3PC (Three-Phase Commit), as well as flexible transaction models like TCC (Try-Confirm-Cancel), local message table, independent message service for distributed transactions, reliable message eventual consistency, and best-effort notification.",
  "page.index.sql.one": "1. Be proficient in SQL (Structured Query Language), including basic operations such as adding, deleting, modifying, and querying data.",
  "page.index.sql.two": " 2. Understand advanced SQL operations such as complex queries, joins, and subqueries.",
  "page.index.sql.three": "3. Be able to design standardized database models, including table design, relationship establishment, index use, etc.",
  "page.index.sql.four": "4. Understand the concepts of normalization and de-normalization.",
  "page.index.sql.five": "5. Understand the types of indexes (such as B-tree indexes, hash indexes) and their role in database query performance optimization.",
  "page.index.sql.six": "6. Be able to select appropriate fields to create indexes and avoid index abuse.",
  "page.index.sql.seven": "7. Understand the concept of database transactions and master the ACID characteristics of transactions.",
  "page.index.sql.eight": "8. Be able to use transactions correctly to ensure data consistency and integrity.",
  "page.index.sql.nine": "9. Use database performance analysis tools to locate and solve problems such as slow queries and performance bottlenecks.",
  "page.index.sql.ten": "10. Optimize query statements to avoid full table scans and improve query efficiency.",
  "page.index.sql.eleven": "11. Avoid security threats such as SQL injection.",
  "page.index.sql.twelve": "12. Familiar with master-slave replication, read-write separation and other technologies.",
  "page.index.source": "source code",
  "page.about.one": "I graduated from Fuzhou University of Technology in 2019 with a major in Electronic Information Engineering. Initially, I had no understanding of programming concepts such as objects, classes, and variables, and struggled with implementing various logics. My academic background covered both hardware and software aspects, including analog and digital electronics, object-oriented programming, and embedded systems.\n\nI found myself less interested in circuits initially, and I didn't dedicate enough effort to learning assembly language for hardware programming. This posed additional challenges for me, especially as someone with zero prior experience. Eventually, I opted to focus on learning Java for object-oriented programming.",
  "page.about.two": "My first job was at Fuzhou University Automation Technology. The technology involved was relatively simple, and I believe anyone with some programming knowledge could handle the tasks. However, this job proved to be a valuable experience for me, as it served as a gateway to my career. Over time, through hands-on experience, researching information, and solving problems at work, I significantly improved my technical skills. After becoming familiar with the job over a year and a half, I started feeling a sense of confusion. The technology used here seemed too basic, and continuing in this direction was not what I aspired to. Issues that could be solved programmatically were being addressed using stored procedures and triggers, and I began to feel a disconnect.",
  "page.about.three": "Later, I joined a company specializing in developing SRM (Supplier Relationship Management) and CRM (Customer Relationship Management) systems. Here, I delved into technologies such as Spring Boot and Spring Cloud for microservices. I gained insights into service registration using tools like Nacos, incorporating dependencies for inter-service communication, and implementing message queues with RabbitMQ in cross-platform service calls. The technical aspects here were not overly challenging, primarily focusing on database design and utilizing Redis for synchronized locks to prevent data inconsistency.\n\nIn the CRM and SRM domains, the emphasis was more on business logic, and a significant amount of my time was devoted to streamlining these processes. I often delved into understanding aspects of permission architecture, such as menu-role-user permissions, table design, and issues related to button permissions.\n\nInitially, I found that the frequent changes in requirements led to repeated code modifications, resulting in various issues. This was especially evident when altering code written by others. The most daunting aspect was dealing with jQuery code within components, where diverse implementation constraints contributed to a chaotic codebase. Everyone added their own pieces, leading to code that was difficult for anyone to comprehend. Additionally, conflicts in permissions were not being enforced correctly, contributing to a substantial waste of time.\n\nWhen taking over someone else's code, I believe it's essential to extract and optimize each functionality's code separately, rather than making direct modifications. This approach can alleviate the burden of subsequent optimizations, especially when dealing with extensive permission and business logic considerations.",
  "page.about.four": "Finally, I joined a company specializing in blockchain technology. Initially, I lacked confidence in this field due to concerns about its instability and risks, which are commonly discussed in the industry. I won't dwell on these aspects as I believe I lack the qualifications to judge. However, working here has been incredibly fulfilling. The team is dedicated to exploring new technologies, constantly optimizing code, and refining existing codebases. Whenever a new technology or project emerges, everyone dives into examining the source code and references implementations. I thoroughly enjoy this collaborative and knowledge-sharing atmosphere.\n\nMy first project here was in the realm of NFTs (Non-Fungible Tokens). While I may not fully grasp the inherent value of NFTs, it seems to stem from their uniqueness and scarcity, which contribute to their perceived worth. Additionally, tokens serve as virtual currencies for creative works, akin to how each country can issue its currency. The ERC20 technology enables individuals and organizations to issue tokens, with the value ultimately determined by the pool created by the issuer of those tokens.\n\nAs I delved into the development and rise of Web3, along with various financial applications, I conducted some tests and familiarized myself with the processes by acquiring and using some coins. GameFi, where NFTs act as the core of games and tokens serve various purposes, intrigued me. NFTs generate daily income tokens, although I haven't personally engaged in this, I've gained some understanding of the concept.\n\nMoving forward, it became imperative to explore decentralized exchanges (DEX), with my initial exposure being to Uniswap, followed by PancakeSwap. Understanding these aspects is crucial, including on-chain blocks, transactions, and related information.",
  "page.about.five": "now work？",
  "page.about.six": "I'm still looking for it at the moment. If you want to outsource work to me or work remotely, you can contact me. If you have a formal full-time job, you can contact me.",
  "page.about.technology.stack": "technology stack",
  "page.about.cooperate": "cooperate",
  "page.about.eleven": "If you think my technology can help you, you can contact me directly."
}
