{
  "page.index.hi": "Hi！",
  "page.index.one": "You can call me",
  "page.index.name": "Robin",
  "page.index.two": "I am engaged in java backend and web3 contract development. I am a person who has many ideas, loves to share and loves to learn new technologies!",
  "page.index.three": "If you want to contact me, you can contact me via telegram!",
  "page.index.four": "work skill",
  "page.index.about": "about",
  "page.index.home": "home",
  "page.index.five": "I am relatively familiar with the eth chain, bnb chain, and apt chain, and have an in-depth understanding of lp staking and swap, V2swap exchange, etc.",
  "page.index.skill": "skill",
  "page.index.solidity.one": " 1. Be proficient in the Solidity programming language and understand basic syntax such as contract structure, functions, and variable declarations.",
  "page.index.solidity.two": " 2. Understand the data types, control structures, function modifiers, etc. in Solidity.",
  "page.index.solidity.three": "3. Ability to write smart contracts, including standard contracts such as ERC-20 and ERC-721.",
  "page.index.solidity.four": "4. Understand the life cycle, deployment, calling, etc. of smart contracts.",
  "page.index.solidity.five": "5. Understand the basic principles and operating mechanisms of the Ethereum blockchain network.",
  "page.index.solidity.six": "6. Know how to connect to the Ethereum network and choose the appropriate node service.",
  "page.index.solidity.seven": "7. Master Ethereum JavaScript libraries such as Web3.js or Ethers.js to interact with the Ethereum blockchain.",
  "page.index.solidity.eight": "8. Able to call contract functions through the library, query status and send transactions.",
  "page.index.solidity.nine": "9. Familiar with Solidity development frameworks such as Hardhat for contract compilation, testing and deployment.",
  "page.index.solidity.ten": "10. Understand the security issues of smart contracts and avoid common vulnerabilities, such as re-entrancy attacks, overflows, etc.",
  "page.index.solidity.eleven": "11. Use tools to conduct code audits to ensure the security of the contract.",
  "page.index.solidity.twelve": "12. Optimize the gas consumption of smart contracts and improve the execution efficiency of contracts.",
  "page.index.solidity.thirteen": "13. Understand the concepts of gas price and gas limit.",
  "page.index.java.one": "1. Proficient in using spring family bucket for development",
  "page.index.java.two": "2. In-depth understanding of Java language, including object-oriented programming (OOP), multi-threaded programming, exception handling, etc.",
  "page.index.java.three": "3. Master Java EE (Enterprise Edition) and SpringFramework specifications.",
  "page.index.java.four": " 4.Familiar with common web development concepts, including HTTP protocol, RESTful architecture, etc.",
  "page.index.java.five": "5. Have a basic understanding of modern front-end frameworks (such as React, Angular or Vue.js).",
  "page.index.java.six": "6. Understand and practice microservice architecture, including service discovery, containerization (Docker), container orchestration (Kubernetes), etc.",
  "page.index.java.seven": "7. Understand the concept and use of message queues, be familiar with RabbitMQ and Apache Kafka, practice message-driven development, and understand asynchronous message processing.",
  "page.index.java.eight": "8. Be familiar with common security vulnerabilities and preventive measures, including cross-site scripting (XSS), cross-site request forgery (CSRF), etc.",
  "page.index.java.nine": "9. Implement authentication and authorization and understand OAuth and JWT.",
  "page.index.java.ten": "10. Familiar with version control tools, such as Git.",
  "page.index.java.eleven": "11. Understand the basic services and deployment processes of cloud service providers (such as AWS, Azure, Google Cloud).",
  "page.index.java.twelve": "12. Understand Docker containerization technology and Kubernetes orchestration system.",
  "page.index.sql.one": "1. Be proficient in SQL (Structured Query Language), including basic operations such as adding, deleting, modifying, and querying data.",
  "page.index.sql.two": " 2. Understand advanced SQL operations such as complex queries, joins, and subqueries.",
  "page.index.sql.three": "3. Be able to design standardized database models, including table design, relationship establishment, index use, etc.",
  "page.index.sql.four": "4. Understand the concepts of normalization and de-normalization.",
  "page.index.sql.five": "5. Understand the types of indexes (such as B-tree indexes, hash indexes) and their role in database query performance optimization.",
  "page.index.sql.six": "6. Be able to select appropriate fields to create indexes and avoid index abuse.",
  "page.index.sql.seven": "7. Understand the concept of database transactions and master the ACID characteristics of transactions.",
  "page.index.sql.eight": "8. Be able to use transactions correctly to ensure data consistency and integrity.",
  "page.index.sql.nine": "9. Use database performance analysis tools to locate and solve problems such as slow queries and performance bottlenecks.",
  "page.index.sql.ten": "10. Optimize query statements to avoid full table scans and improve query efficiency.",
  "page.index.sql.eleven": "11. Avoid security threats such as SQL injection.",
  "page.index.sql.twelve": "12. Familiar with master-slave replication, read-write separation and other technologies.",
  "page.index.source": "source code",
  "page.about.one": "I graduated from Fuzhou Institute of Technology in 2019. I knew nothing about programming technology at the beginning. I had no idea what objects, classes, and variables were, including how to implement various logics. My major is electronic information engineering. I think I have more contact with analog electrical and digital electronics and embedded systems. I was asked to connect circuits, but I didn’t feel very interested. They asked me to do assembly hardware, and I didn’t study hard. I feel that it is more difficult for me with 0 basic knowledge. Finally, I chose Java object-oriented learning.",
  "page.about.two": "My first job was at FuDa Automation Technology. The technology was very simple. I thought anyone who knew some code could do the job. However, this job has taught me a lot, and it really introduced me. Many technologies that I didn’t understand before have obviously improved over time, including the skills of querying information. After working for a year and a half, I became familiar with it, and then I started to feel confused. , the technology here is too simple, and it is definitely not what I want to continue learning. Basically, the program can solve the problem, but using stored procedures and triggers, I feel that I will be out of touch if I continue.",
  "page.about.three": "Later, I went to a company that develops srm and crm, where I came into contact with the technologies of springBoot and SpringCloud microservices. I also learned how to register services with nacos, how to introduce dependencies to allow microservices to call each other, and how to use rabbitmq for service calls on each platform. Go to queue. The technology here is not too difficult. Of course, I also learned more about new technologies at this time. After doing CRM and SRM, I found that this area seems to pay more attention to business. The method of implementation is not very important. In short, the first rule is, first Implementation won't go wrong. I often learn about some permission structures, such as menu role user permissions, table design and button permissions. At first, I felt that the changes in requirements were too big. I had to modify the code repeatedly, but various problems would appear repeatedly, especially when modifying other people's codes. The most frightening thing was the jq code in the component, which had various writing restrictions. In the end, the code was pieced together here and there, and each person added something. As a result, no one could understand it, and permission conflicts did not take effect, which wasted a lot of time. If you want to take over other people's code, I think you need to take it over and pull out each functional code and optimize it again. If you start changing it directly, subsequent optimization will be more tiring.",
  "page.about.four": "Finally, I accidentally joined a company that specializes in blockchain technology. At first, I had no confidence in this field. Everyone said it was unstable and risky. I won’t say anything about this. I’m not qualified to judge, but here I am more fulfilled every day. Everyone is pursuing new technologies and often optimizing the code. They will repeatedly refine and optimize the written code. Whenever a new technology or new When the project comes out, everyone will follow it to read the source code and refer to the implementation. I like this feeling very much. The first project I came into contact with here is to make NFT domain names, which is an NFT project. It is probably a replica of Opensea and also buys and sells NFTs. It also has benchmark domain names and fragmented domain names, which are sold in pieces, and it also has auction voting functions. I am learning this knowledge every day, and I seem to be immersed in the ocean of knowledge. I understand the development and rise of web3, as well as financial gameplay. I also took some coins to do some testing and familiarize myself with the process. Now I mainly use erc20 as a token. There is also erc721 for nft, and the game seems to be played with nft attributes. The next step is to do lp and swap. The earliest contact with this area was uniswap, and later pancakeswap appeared. I personally think pancakeswap seems to be more useful.",
  "page.about.five": "now work？",
  "page.about.six": "I'm still looking for it at the moment. If you want to outsource work to me or work remotely, you can contact me. If you have a formal full-time job, you can contact me.",
  "page.about.technology.stack": "technology stack",
  "page.about.cooperate": "cooperate",
  "page.about.eleven": "If you think my technology can help you, you can contact me directly."
}
